//導入ユニット　C言語　問題2　テキスト４４ページ　サンプル2－3Aを入力し、実行しなさい。
//1423056　渡邉　翔　2014/10/03

#include <stdio.h>

int main(){
	printf("1+1=%d\n", 2);
	printf("5-3=%d\n", 5-3);
	printf("3*2=%d\n", 3*2);
	printf("5/2=%d\n", 5/2);
	printf("5%%2=%d\n", 5%2);		//％％と書く理由は、3章で解説

	printf("1.5+1.4=%d\n", 1.5+1.4);		//実数の計算結果を誤って％d（整数）で出力
	printf("1.5+1.4=%f\n", 1.5+1.4);		//実数の計算結果を％fで出力

	printf("3+3=%d\n", 3+3);
	printf("3+3=%3d\n", 3+3);
	printf("1.5+1.4=%.2f\n", 1.5+1.4);
	printf("1.5+1.4=%2.2f\n", 1.5+1.4);
	printf("1.5+1.4=%4.2f\n",1.5+1.4);
	printf("1.5+1.4=%5.2f\n",1.5+1.4);
	printf("1.5+1.4=%6.2f\n",1.5+1.4);
	return 0;
}